Ran Plan for dir: `terraform/kubernetes` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.6.4 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/resnostyle/k8s-gitops/1400/default/terraform/kubernetes/default.tfplan\"" in "/home/atlantis/.atlantis/repos/resnostyle/k8s-gitops/1400/default/terraform/kubernetes": exit status 1
tls_private_key.kube_vm_key: Refreshing state... [id=fdd3931186a93f75744b93faaf688a85054e20aa]
data.sops_file.host_secrets: Reading...
random_password.kube_vm_password: Refreshing state... [id=none]
data.sops_file.host_secrets: Read complete after 0s [id=-]
data.vault_generic_secret.cloudflare_creds: Reading...
data.vault_generic_secret.proxmox_creds: Reading...
data.vault_generic_secret.common_creds: Reading...
data.vault_generic_secret.proxmox_creds: Read complete after 1s [id=secret/terraform/proxmox]
proxmox_virtual_environment_file.iso_image["0"]: Refreshing state... [id=backup-nas:iso/debian-12.2.0-amd64-netinst.iso]
data.vault_generic_secret.cloudflare_creds: Read complete after 1s [id=secret/terraform/cloudflare]
proxmox_virtual_environment_vm.kube_cp[2]: Refreshing state... [id=502]
data.vault_generic_secret.common_creds: Read complete after 1s [id=secret/common/user_profile/bryan]
proxmox_virtual_environment_vm.kube_cp[0]: Refreshing state... [id=500]
proxmox_virtual_environment_vm.kube_wk[2]: Refreshing state... [id=552]
proxmox_virtual_environment_vm.kube_cp[1]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.kube_wk[0]: Refreshing state... [id=550]
data.cloudflare_zone.bryanwp: Reading...
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]
cloudflare_record.kube_cp[1]: Refreshing state... [id=ca5a86588716dbc815b6ccb0eaf13e69]
cloudflare_record.kube_cp[2]: Refreshing state... [id=d66c9cf23d45d32ef07d6d70d9c5888e]
cloudflare_record.kube_cp[0]: Refreshing state... [id=3d1f7ebd5f328ef7b6f54e7cd7f07932]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # proxmox_virtual_environment_file.iso_image["1"] will be created
  + resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "http://channels.nixos.org/nixos-23.05/latest-nixos-minimal-x86_64-linux.iso"
        }
    }

  # proxmox_virtual_environment_file.wk_config will be created
  + resource "proxmox_virtual_environment_file" "wk_config" {
      + content_type           = "snippets"
      + datastore_id           = "local-lvm"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                #cloud-config
                write_files:
                  - path: /etc/systemd/system/k3s-agent.service
                    content: |
                      [Unit]
                      Description=Lightweight Kubernetes
                      Documentation=https://k3s.io
                
                      [Service]
                      ExecStartPre=-/sbin/modprobe br_netfilter
                      ExecStartPre=-/sbin/modprobe overlay
                      ExecStartPre=/sbin/sysctl -w net.ipv4.conf.all.rp_filter=1
                      ExecStartPre=/sbin/sysctl -w net.ipv4.conf.default.rp_filter=1
                      ExecStartPre=/sbin/sysctl -w net.bridge.bridge-nf-call-iptables=1
                      ExecStartPre=/sbin/sysctl -w net.bridge.bridge-nf-call-ip6tables=1
                      ExecStart=/usr/local/bin/k3s agent
                
                      [Install]
                      WantedBy=multi-user.target
                
                runcmd:
                  - curl -sfL https://get.k3s.io | INSTALL_K3S_EXEC="--node-taint CriticalAddonsOnly=true:NoExecute" sh -
            EOT
          + file_name = "example.cloud-config.yaml"
          + resize    = 0
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Error: expected user_data_file_id to be a valid file identifier (datastore-name:iso/some-file.img), got proxmox_virtual_environment_file.wk_config.id
│ 
│   with proxmox_virtual_environment_vm.kube_wk[1],
│   on wk-k8s.tf line 54, in resource "proxmox_virtual_environment_vm" "kube_wk":
│   54:     user_data_file_id = "proxmox_virtual_environment_file.wk_config.id"
│ 
╵
╷
│ Error: expected user_data_file_id to be a valid file identifier (datastore-name:iso/some-file.img), got proxmox_virtual_environment_file.wk_config.id
│ 
│   with proxmox_virtual_environment_vm.kube_wk[2],
│   on wk-k8s.tf line 54, in resource "proxmox_virtual_environment_vm" "kube_wk":
│   54:     user_data_file_id = "proxmox_virtual_environment_file.wk_config.id"
│ 
╵
╷
│ Error: expected user_data_file_id to be a valid file identifier (datastore-name:iso/some-file.img), got proxmox_virtual_environment_file.wk_config.id
│ 
│   with proxmox_virtual_environment_vm.kube_wk[0],
│   on wk-k8s.tf line 54, in resource "proxmox_virtual_environment_vm" "kube_wk":
│   54:     user_data_file_id = "proxmox_virtual_environment_file.wk_config.id"
│ 
╵


```
</details>